Revit 2027 API
BuiltInFailures.StairRampFailures.ContinuousRailSupportPlacementFailure Property
 Cannot place the supports along the rail path.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId ContinuousRailSupportPlacementFailure { get; }
Public Shared ReadOnly Property ContinuousRailSupportPlacementFailure As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ ContinuousRailSupportPlacementFailure {
	FailureDefinitionId^ get ();
}
static member ContinuousRailSupportPlacementFailure : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace